In [2]:
import pandas as pd

In [3]:
from univariate import univariate

In [4]:
dataset=pd.read_csv("Placement.csv")

In [5]:
dataset

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
210,211,M,80.60,Others,82.00,Others,Commerce,77.60,Comm&Mgmt,No,91.0,Mkt&Fin,74.49,Placed,400000.0
211,212,M,58.00,Others,60.00,Others,Science,72.00,Sci&Tech,No,74.0,Mkt&Fin,53.62,Placed,275000.0
212,213,M,67.00,Others,67.00,Others,Commerce,73.00,Comm&Mgmt,Yes,59.0,Mkt&Fin,69.72,Placed,295000.0
213,214,F,74.00,Others,66.00,Others,Commerce,58.00,Comm&Mgmt,No,70.0,Mkt&HR,60.23,Placed,204000.0
214,215,M,62.00,Central,58.00,Others,Science,53.00,Comm&Mgmt,No,89.0,Mkt&HR,60.22,Not Placed,NaN

In [6]:
quan,qual=univariate.QuanQual(dataset)

In [7]:
print(quan)
print(qual)

['sl_no', 'ssc_p', 'hsc_p', 'degree_p', 'etest_p', 'mba_p', 'salary']
['gender', 'ssc_b', 'hsc_b', 'hsc_s', 'degree_t', 'workex', 'specialisation', 'status']

In [8]:
descriptive=pd.DataFrame()
descriptive

Empty DataFrame
Columns: []
Index: []

In [9]:
descriptive=pd.DataFrame(index=["Mean","Median","Mode"],columns=quan)
descriptive

       sl_no ssc_p hsc_p degree_p etest_p mba_p salary
Mean     NaN   NaN   NaN      NaN     NaN   NaN    NaN
Median   NaN   NaN   NaN      NaN     NaN   NaN    NaN
Mode     NaN   NaN   NaN      NaN     NaN   NaN    NaN

In [10]:
descriptive=pd.DataFrame(index=["Mean","Median","Mode"],columns=quan)
descriptive["degree_p"]["Mean"]
dataset["degree_p"].mean()

66.37018604651163

In [11]:
for columnname in quan:
    descriptive[columnname]["Mean"]=dataset[columnname].mean()

In [12]:
descriptive

       sl_no    ssc_p    hsc_p degree_p  etest_p    mba_p  salary
Mean     108  67.3034  66.3332  66.3702  72.1006  62.2782  288655
Median   NaN      NaN      NaN      NaN      NaN      NaN     NaN
Mode     NaN      NaN      NaN      NaN      NaN      NaN     NaN

In [13]:
descriptive=pd.DataFrame(index=["Mean","Median","Mode"],columns=quan)
for columnname in quan:
    descriptive[columnname]["Mean"]=dataset[columnname].mean()
    descriptive[columnname]["Median"]=dataset[columnname].median()
    descriptive[columnname]["Mode"]=dataset[columnname].mode()[0]

In [14]:
descriptive

       sl_no    ssc_p    hsc_p degree_p  etest_p    mba_p  salary
Mean     108  67.3034  66.3332  66.3702  72.1006  62.2782  288655
Median   108       67       65       66       71       62  265000
Mode       1       62       63       65       60     56.7  300000

In [15]:
import numpy as np

In [16]:
np.percentile(dataset["ssc_p"],25)

60.599999999999994

In [17]:
dataset.describe()

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
count,215.000000,215.000000,215.000000,215.000000,215.000000,215.000000,148.000000
mean,108.000000,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405
std,62.209324,10.827205,10.897509,7.358743,13.275956,5.833385,93457.452420
min,1.000000,40.890000,37.000000,50.000000,50.000000,51.210000,200000.000000
25%,54.500000,60.600000,60.900000,61.000000,60.000000,57.945000,240000.000000
50%,108.000000,67.000000,65.000000,66.000000,71.000000,62.000000,265000.000000
75%,161.500000,75.700000,73.000000,72.000000,83.500000,66.255000,300000.000000
max,215.000000,89.400000,97.700000,91.000000,98.000000,77.890000,940000.000000

In [18]:
descriptive=pd.DataFrame(index=["Mean","Median","Mode","Q1:25%","Q2:50%","Q3:75%","99%","Q4:100%"],columns=quan)
for columnname in quan:
    descriptive[columnname]["Mean"]=dataset[columnname].mean()
    descriptive[columnname]["Median"]=dataset[columnname].median()
    descriptive[columnname]["Mode"]=dataset[columnname].mode()[0]
    descriptive[columnname]["Q1:25%"]=dataset.describe()[columnname]["25%"]
    descriptive[columnname]["Q2:50%"]=dataset.describe()[columnname]["50%"]
    descriptive[columnname]["Q3:75%"]=dataset.describe()[columnname]["75%"]
    descriptive[columnname]["99%"]=np.percentile(dataset[columnname],99)
    descriptive[columnname]["Q4:100%"]=dataset.describe()[columnname]["max"]

In [19]:
descriptive

          sl_no    ssc_p    hsc_p degree_p  etest_p    mba_p  salary
Mean        108  67.3034  66.3332  66.3702  72.1006  62.2782  288655
Median      108       67       65       66       71       62  265000
Mode          1       62       63       65       60     56.7  300000
Q1:25%     54.5     60.6     60.9       61       60   57.945  240000
Q2:50%      108       67       65       66       71       62  265000
Q3:75%    161.5     75.7       73       72     83.5   66.255  300000
99%      212.86       87    91.86    83.86       97  76.1142     NaN
Q4:100%     215     89.4     97.7       91       98    77.89  940000

In [20]:
descriptive=pd.DataFrame(index=["Mean","Median","Mode","Q1:25%","Q2:50%","Q3:75%","99%","Q4:100%","IQR","1.5rule","lesser","greater","min","max"],columns=quan)
for columnname in quan:
    descriptive[columnname]["Mean"]=dataset[columnname].mean()
    descriptive[columnname]["Median"]=dataset[columnname].median()
    descriptive[columnname]["Mode"]=dataset[columnname].mode()[0]
    descriptive[columnname]["Q1:25%"]=dataset.describe()[columnname]["25%"]
    descriptive[columnname]["Q2:50%"]=dataset.describe()[columnname]["50%"]
    descriptive[columnname]["Q3:75%"]=dataset.describe()[columnname]["75%"]
    descriptive[columnname]["99%"]=np.percentile(dataset[columnname],99)
    descriptive[columnname]["Q4:100%"]=dataset.describe()[columnname]["max"]
    descriptive[columnname]["IQR"]=descriptive[columnname]["Q3:75%"]-descriptive[columnname]["Q1:25%"]
    descriptive[columnname]["1.5rule"]=1.5*descriptive[columnname]["IQR"]
    descriptive[columnname]["lesser"]=descriptive[columnname]["Q1:25%"]-descriptive[columnname]["1.5rule"]
    descriptive[columnname]["greater"]=descriptive[columnname]["Q3:75%"]+descriptive[columnname]["1.5rule"]
    descriptive[columnname]["min"]=dataset[columnname].min()
    descriptive[columnname]["max"]=dataset[columnname].max()

In [32]:
descriptive

          sl_no    ssc_p    hsc_p degree_p  etest_p    mba_p  salary
Mean        108  67.3034  66.3332  66.3702  72.1006  62.2782  288655
Median      108       67       65       66       71       62  265000
Mode          1       62       63       65       60     56.7  300000
Q1:25%     54.5     60.6     60.9       61       60   57.945  240000
Q2:50%      108       67       65       66       71       62  265000
Q3:75%    161.5     75.7       73       72     83.5   66.255  300000
99%      212.86       87    91.86    83.86       97  76.1142     NaN
Q4:100%     215     89.4     97.7       91       98    77.89  940000
IQR         107     15.1     12.1       11     23.5     8.31   60000
1.5rule   160.5    22.65    18.15     16.5    35.25   12.465   90000
lesser     -106    37.95    42.75     44.5    24.75    45.48  150000
greater     322    98.35    91.15     88.5   118.75    78.72  390000
min           1    40.89       37       50       50    51.21  200000
max         215     89.4     97.7       91       98    77.89  940000

In [22]:
lesser=[]
greater=[]
for columnname in quan:
    if descriptive[columnname]["min"]<descriptive[columnname]["lesser"]:
        lesser.append(columnname)
    if descriptive[columnname]["max"]>descriptive[columnname]["greater"]:
        greater.append(columnname)

In [23]:
print(lesser)
greater

['hsc_p']

['hsc_p', 'degree_p', 'salary']

In [24]:
dataset[columnname]

0      270000.0
1      200000.0
2      250000.0
3           NaN
4      425000.0
         ...
210    400000.0
211    275000.0
212    295000.0
213    204000.0
214         NaN
Name: salary, Length: 215, dtype: float64

In [33]:
for columnname in lesser:
    dataset.loc[dataset[columnname]<descriptive[columnname]["lesser"],columnname]=descriptive[columnname]["lesser"]
    descriptive[columnname]["min"]=dataset[columnname].min()

In [34]:
lesser=[]
greater=[]
for columnname in quan:
    if descriptive[columnname]["min"]<descriptive[columnname]["lesser"]:
        lesser.append(columnname)
    if descriptive[columnname]["max"]>descriptive[columnname]["greater"]:
        greater.append(columnname)

In [35]:
print(lesser)

[]

In [36]:
dataset["ssc_p"].value_counts()

62.00    11
63.00    10
67.00     9
52.00     9
73.00     9
         ..
80.60     1
65.20     1
80.40     1
59.96     1
78.50     1
Name: ssc_p, Length: 103, dtype: int64

In [37]:
Fretable=pd.DataFrame(columns=["Unique_values","Frequency","Relative_Fre","Cusum"])

In [38]:
Fretable

Empty DataFrame
Columns: [Unique_values, Frequency, Relative_Fre, Cusum]
Index: []

In [39]:
Fretable["Unique_values"]=dataset["ssc_p"].value_counts().index
Fretable["Frequency"]=dataset["ssc_p"].value_counts().values
Fretable["Relative_Fre"]=(Fretable["Frequency"]/103)
Fretable["Cusum"]=Fretable["Relative_Fre"].cumsum()

In [40]:
def Fretable(columnname,dataset):
    Fretable=pd.DataFrame(columns=["Unique_values","Frequency","Relative_Fre","Cusum"])
    Fretable["Unique_values"]=dataset[columnname].value_counts().index
    Fretable["Frequency"]=dataset[columnname].value_counts().values
    Fretable["Relative_Fre"]=(Fretable["Frequency"]/103)
    Fretable["Cusum"]=Fretable["Relative_Fre"].cumsum()
    return Fretable

In [41]:
Fretable("hsc_p",dataset)

    Unique_values  Frequency  Relative_Fre     Cusum
0           63.00         14      0.135922  0.135922
1           62.00         12      0.116505  0.252427
2           60.00          9      0.087379  0.339806
3           67.00          9      0.087379  0.427184
4           64.00          8      0.077670  0.504854
..            ...        ...           ...       ...
88          49.80          1      0.009709  2.048544
89          60.80          1      0.009709  2.058252
90          89.83          1      0.009709  2.067961
91          66.60          1      0.009709  2.077670
92          91.00          1      0.009709  2.087379

[93 rows x 4 columns]

In [42]:
def univariate(dataset,quan):
        descriptive=pd.DataFrame(index=["Mean","Median","Mode","Q1:25%","Q2:50%","Q3:75%","99%","Q4:100%","IQR","1.5rule","lesser","greater","min","max","skewness","kurtosis"],columns=quan)
        for columnname in quan:
            descriptive[columnname]["Mean"]=dataset[columnname].mean()
            descriptive[columnname]["Median"]=dataset[columnname].median()
            descriptive[columnname]["Mode"]=dataset[columnname].mode()[0]
            descriptive[columnname]["Q1:25%"]=dataset.describe()[columnname]["25%"]
            descriptive[columnname]["Q2:50%"]=dataset.describe()[columnname]["50%"]
            descriptive[columnname]["Q3:75%"]=dataset.describe()[columnname]["75%"]
            descriptive[columnname]["99%"]=np.percentile(dataset[columnname],99)
            descriptive[columnname]["Q4:100%"]=dataset.describe()[columnname]["max"]
            descriptive[columnname]["IQR"]=descriptive[columnname]["Q3:75%"]-descriptive[columnname]["Q1:25%"]
            descriptive[columnname]["1.5rule"]=1.5*descriptive[columnname]["IQR"]
            descriptive[columnname]["lesser"]=descriptive[columnname]["Q1:25%"]-descriptive[columnname]["1.5rule"]
            descriptive[columnname]["greater"]=descriptive[columnname]["Q3:75%"]+descriptive[columnname]["1.5rule"]
            descriptive[columnname]["min"]=dataset[columnname].min()
            descriptive[columnname]["max"]=dataset[columnname].max()
            descriptive[columnname]["skewness"]=dataset[columnname].skew()
            descriptive[columnname]["kurtosis"]=dataset[columnname].kurtosis()

        return descriptive

In [43]:
univariate(dataset,quan)

           sl_no     ssc_p     hsc_p   degree_p   etest_p     mba_p   salary
Mean         108   67.3034   66.3964    66.3702   72.1006   62.2782   288655
Median       108        67        65         66        71        62   265000
Mode           1        62        63         65        60      56.7   300000
Q1:25%      54.5      60.6      60.9         61        60    57.945   240000
Q2:50%       108        67        65         66        71        62   265000
Q3:75%     161.5      75.7        73         72      83.5    66.255   300000
99%       212.86        87     91.86      83.86        97   76.1142      NaN
Q4:100%      215      89.4      97.7         91        98     77.89   940000
IQR          107      15.1      12.1         11      23.5      8.31    60000
1.5rule    160.5     22.65     18.15       16.5     35.25    12.465    90000
lesser      -106     37.95     42.75       44.5     24.75     45.48   150000
greater      322     98.35     91.15       88.5    118.75     78.72   390000
min            1     40.89     42.75         50        50     51.21   200000
max          215      89.4      97.7         91        98     77.89   940000
skewness       0 -0.132649  0.254921   0.244917  0.282308  0.313576  3.56975
kurtosis    -1.2  -0.60751  0.311195  0.0521433  -1.08858 -0.470723  18.5443